2013/brp 2013-02-07/test/trunk/PUC501 OPvB - Opvragen details persoon en relaties/ART/request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
<brp:ALG_GeefDetailsPersoon_V xmlns:brp="http://www.bprbzk.nl/BRP/0100"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                              xsi:schemaLocation="http://www.bprbzk.nl/BRP/0100 BRP0100_Bevraging_Berichten.xsd">
   <brp:stuurgegevens>
      <stuf:berichtcode xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">${DataSource Values#berichtcode_sAA0}</stuf:berichtcode>
      <stuf:zender xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">
         <stuf:organisatie>${DataSource Values#organisatie_zsA0}</stuf:organisatie>
         <stuf:applicatie>${DataSource Values#applicatie_zsA0}</stuf:applicatie>
      </stuf:zender>
      <stuf:referentienummer xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">${DataSource Values#referentienummer_sAA0}</stuf:referentienummer>
      <stuf:functie xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">${DataSource Values#functie_sAA0}</stuf:functie>
   </brp:stuurgegevens>
   <brp:vraag xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302"
              brp:communicatieID="aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
              stuf:entiteittype="Vraag">
      <brp:zoekcriteria brp:communicatieID="${DataSource Values#|zoekcriteria|}"
                        brp:referentieID="aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
                        stuf:entiteittype="aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
                        brp:technischeSleutel="aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa">
         <brp:burgerservicenummer stuf:noValue="waardeOnbekend">${DataSource Values#burgerservicenummer_zvA0}</brp:burgerservicenummer>
         <brp:technischeSleutel>${DataSource Values#technischeSleutel_zvA0}</brp:technischeSleutel>
      </brp:zoekcriteria>
   </brp:vraag>
</brp:ALG_GeefDetailsPersoon_V>
  </soapenv:Body>
</soapenv:Envelope>