2013/brp 2013-02-07/test/trunk/PUC501 OPvB - Bepalen personen op adres met relaties/ART/request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>${DataSource Values#Header_EEE0}</soapenv:Header>
   <soapenv:Body>
      <ns:ALG_GeefPersonenOpAdresMetBetrokkenheden_Vi xmlns:ns="http://www.bprbzk.nl/BRP/0100">
         <ns:stuurgegevens>
            <stuf:berichtcode xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">${DataSource Values#berichtcode_sAB0}</stuf:berichtcode>
            <stuf:zender xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">
               <stuf:organisatie>${DataSource Values#organisatie_zsA0}</stuf:organisatie>
               <stuf:applicatie>${DataSource Values#applicatie_zsA0}</stuf:applicatie>
            </stuf:zender>
            <stuf:referentienummer xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">${DataSource Values#referentienummer_sAB0}</stuf:referentienummer>
            <stuf:functie xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">${DataSource Values#functie_sAB0}</stuf:functie>
         </ns:stuurgegevens>
         <ns:parameters ns:communicatieID="parameters">
            <ns:peilmomentMaterieel xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302"
                                    >${DataSource Values#peilmomentMaterieel_pAB0}</ns:peilmomentMaterieel>
         </ns:parameters>
         <ns:vraag xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302" ns:communicatieID="vraag"
                   stuf:entiteittype="Vraag">
            <ns:zoekcriteria ns:communicatieID="zoekcriteria" stuf:entiteittype="zoekcriteria" ns:technischeSleutel="aaaaa"
                             ns:referentieID="geen">
               <ns:burgerservicenummer>${DataSource Values#burgerservicenummer_zvA0}</ns:burgerservicenummer>
               <ns:gemeenteCode>${DataSource Values#gemeenteCode_zvA0}</ns:gemeenteCode>
               <ns:naamOpenbareRuimte>${DataSource Values#naamOpenbareRuimte_zvA0}</ns:naamOpenbareRuimte>
               <ns:huisnummer>${DataSource Values#huisnummer_zvA0}</ns:huisnummer>
               <ns:huisletter>${DataSource Values#huisletter_zvA0}</ns:huisletter>
               <ns:huisnummertoevoeging>${DataSource Values#huisnummertoevoeging_zvA0}</ns:huisnummertoevoeging>
               <ns:postcode>${DataSource Values#postcode_zvA0}</ns:postcode>
            </ns:zoekcriteria>
         </ns:vraag>
      </ns:ALG_GeefPersonenOpAdresMetBetrokkenheden_Vi>
   </soapenv:Body>
</soapenv:Envelope>
